{
  "project_name": "One Bank One Offer Portal (OBOP)",
  "project_description": "OBOP is an initiative by HDFC Bank to unify customer offers across all digital assets by leveraging a centralized intelligence and a single set of APIs. The project aims to provide a consistent, personalized, and seamless customer experience by ensuring that the same customer receives the same next best offers (NBOs) across all HDFC Bank digital touchpoints.",
  "objectives": [
    "Provide a unified and consistent customer experience across all HDFC Bank digital assets.",
    "Establish a single source of truth for customer offers and recommendations.",
    "Increase customer engagement with offers by reducing fragmentation and inconsistency.",
    "Enable personalized, data-driven offer recommendations using a central rule engine.",
    "Facilitate seamless integration and SSO across HDFC Bank digital assets."
  ],
  "scope": [
    "In Scope for MVP1:",
    "Integration of Smartbuy, Alliance, and Consumer Durable Loans offers.",
    "Hashed mobile number-based customer identification.",
    "Monthly dump of top 40 merchant recommendations per customer from CIU to Crayon Data.",
    "Rule-engine based offer selection and real-time personalization.",
    "Choice API integration with Smartbuy portal.",
    "Offer Management Platform with maker-checker flows and approval/rejection.",
    "Support for zip codes on store locations.",
    "Onboarding of offers using OMP offers template.",
    "Filtering and prioritization of offers based on card type.",
    "Batch-based NBO implementation for non-Smartbuy assets (monthly/daily dumps).",
    "SSO integration for seamless user redirection.",
    "Out of Scope for MVP1:",
    "Banking product/portfolio offers (e.g., personal loan, home loan).",
    "Integration with third-party tools or calculators.",
    "Offer value derivation and advanced/voice search.",
    "Real-time personalization and interaction tracking on non-Smartbuy assets.",
    "Performance tracking on non-Smartbuy assets.",
    "Location-based offers for non-Smartbuy assets.",
    "Front-end rendering on non-Smartbuy assets."
  ],
  "stakeholders": [
    "HDFC Bank (primary stakeholder)",
    "CMO of HDFC Bank (budget holder)",
    "Offer onboarding teams (Smartbuy, Alliance, Payzapp, Consumer Durables Loan)",
    "Design team (Smartbuy front end)",
    "CIU team (customer intelligence and recommendations)",
    "Asset owning teams (Netbanking app/website, HDFC bank website)",
    "Crayon Data (choice API and backend intelligence)",
    "R360 (Smartbuy front end vendor)"
  ],
  "key_features": [
    "Centralized offer recommendation engine (choice API).",
    "Personalized, rule-based offer selection for each customer.",
    "Unified customer identifier (hashed mobile number) across all assets.",
    "Offer Management Portal (OMP) for centralized offer onboarding and approval.",
    "Batch-based and real-time API-based NBO delivery.",
    "SSO integration for seamless user journeys.",
    "Support for multiple offer categories (Apparel, Dining, Electronics, etc.).",
    "ETB/NTB customer segmentation and logic.",
    "Merchant and offer filtering/prioritization based on card type.",
    "Interaction capture (like/dislike, bookmark, views) on Smartbuy.",
    "Fatigue factor and repeat capping logic for recommendations.",
    "Maker-checker flows and offer approval/rejection."
  ],
  "technical_requirements": [
    "Monthly SFTP transfer of CIU files (parquet format, up to 50GB).",
    "Batch and dynamic recommendation rule engine.",
    "Choice API integration with Smartbuy and other digital assets.",
    "Offer ingestion in OMP format.",
    "Single tenant architecture for HDFC Bank data.",
    "Encrypted SFTP file transfer with checksum validation.",
    "API whitelisting between Crayon Data and R360.",
    "Stage and Production environments for integration and testing.",
    "Support for 10M API calls/month (MVP1), scalable to 40M/month.",
    "Hashed mobile number as unique customer identifier.",
    "Card type mapping and validation (INFINIA, DINERS BLACK, etc.).",
    "Batch file generation for non-Smartbuy assets (top 5 merchants/offers per customer).",
    "SSO token-based redirection between assets.",
    "Front end integration with R360 (Smartbuy) and API endpoint.",
    "VAPT already done for choice API; further VAPT out of scope."
  ],
  "timeline_estimate": "Each sprint is 2 weeks with ~2 features delivered per sprint. Data pipeline publishes within 5 working days post CIU file validation; additional 5 days if rule/structure changes. MVP1 timeline not explicitly stated but implied to be incremental with future MVPs.",
  "risks": [
    "System stability concerns due to API integrations (past RBI penalties).",
    "Incomplete or inconsistent CIU file data leading to incorrect ETB/NTB classification.",
    "Delays in offer data sharing from HDFC Bank teams (e.g., Payzapp data pending).",
    "Potential issues with SFTP file size/transfer.",
    "Dependency on accurate card type mapping and customer identifier consistency.",
    "Limited ability to track or personalize on non-Smartbuy assets.",
    "Integration or compliance sign-off delays.",
    "Potential for user fatigue if fatigue factor logic is not properly tuned."
  ],
  "assumptions": [
    "HDFC Bank will generate and share a unified hashed mobile number for each customer.",
    "Same rule engine will apply across all use cases.",
    "Expected traffic for choice API is 10M/month for MVP1, scalable to 40M/month.",
    "For MVP1, HDFC Bank will share Alliance and Smartbuy offers in OMP template; MVP2 onwards, all offers will be onboarded via OMP.",
    "All customers are assumed to have debit cards; credit card info comes from CIU file.",
    "CIU will maintain consistency in hashed id mapping across batches.",
    "SFTP infrastructure is managed and adequately provisioned by HDFC Bank.",
    "No real-time personalization or interaction tracking on non-Smartbuy assets.",
    "Front end rendering on non-Smartbuy assets is HDFC Bank’s responsibility.",
    "VAPT for choice API is already completed; further VAPT is HDFC Bank’s responsibility if required."
  ]
}